# 2) შექმენით ცვლადი სადაც შეინახავთ integer ტიპის მონაცემს, შემდეგ შეამოწმეთ თუ ეს რიცხვი რომელიც ცვლადში გაქვთ შენახული მეტია 10 ზე დაპრინტეთ "more than 10" სხვა შემთხვებაში დაპრინტეთ "less than 10"

# 3) მომხმარებელს შემოაყვანინეთ რიცხვი, შემდეგ შეამოწმეთ თუ ეს რიცხვი უდრის 15 ს დაუპრინტეთ "equal to 15" სხვა შემთხვევაში დაუპრინტეთ "not equal to 15"

# 4) მომხმარებელს შემოატანეთ სტრინგი. შენი დავალებაა შეამოწმო, თუ მომხამრებლის მიერ შემოყვანილი სტრინგი არის group92 დაუპრინტეთ 'you are correct" სხვა შემთხვევაში დაუპრინტეთ "you are wrong"

# 5) დაატრიალეთ for ციკლი 50 დან 100 მდე 5 ის გამოტოვებით

# 6) for ციკლის დახმარებით გამოიტანეთ ტერმინალში თქვენი სახელი და გვარი

# 7) while loop ის დახმარებით ტერმინალში გამოიტანეთ რიცხვები 20 დან 50 მდე

# 8) დაბეჭდეთ 0-დან 100-მდე ყველა რიცხვი. (for-თაც და while-თაც)

# 9) დაბეჭდეთ 0-დან 100-ის ჩათვლით ყველა რიცხვი. (for-თაც და while-თაც)

# 10) დაბეჭდეთ 10-დან 20-მდე ყველე რიცხვი (for-თაც და while-თაც)

# 11) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყოველი მე-5 რიცხვი (for-თაც და while-თაც)

# 12) დაბეჭდეთ 10-დან 0-ის ჩათვლით ყველა რიცხვი (for-თაც და while-თაც)

# 13) მომხმარებელს შემოაყვანიეთ რაიმე რიცხვი(მთელი/ათწილადი); შეამოწმეთ ეს რიცხვი - 
# --> თუ დადებითია დაპრინტეთ 'ეს რიცხვი დადებითი რიცხვია'
# --> თუ უარყოფითია დაპრინტეთ 'ეს რიცხვი უარყოფითი რიცხვია'
# --> თუ ნულია დაპრინტეთ 'ეს რიცხვი ნულია'

# 14) მომხმარებელს შემოაყვანიეთ თავისი ასაკი:
# 0–12 წლის ასაკი --> დაპრინტეთ 'ბავშვი ხარ'
# 13-19 წლის ასაკი --> დაპრინტეთ 'მოზარდი/თინეიჯერი ხარ'
# 20-64 წლის ასაკი --> დაპრინტეთ 'ზრდასრული ხართ'
# 65-120 წლის ასაკი --> დაპრინტეთ 'ხანში შესული ხართ'
# 120 და ზემოთ --> დაპრინტეთ 'გურუ ან ჯადოქარი'
# თუ შემოყვანილი ასაკი უარყოფითია --> დაპრინტეთ 'არასწორი ინფო'

# 15) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი

# 16) შემოატანიეთ მომხმარებელს რიცხვი 1-დან 7-ჩათვლით
# თუ 1 --> დაპრინტეთ 'ორშაბათი'
# თუ 2 --> დაპრინტეთ 'სამშაბათი'
# თუ 3 --> დაპრინტეთ 'ოთხშაბათი'
# თუ 4 --> დაპრინტეთ 'ხუთშაბათი'
# თუ 5 --> დაპრინტეთ 'პარასკევი' 
# თუ 6 --> დაპრინტეთ 'შაბათი'
# თუ 7 --> დაპრინტეთ 'კვირა' 
# სხვა დანარჩენი --> 'არ ვიცი ეგ რა დღეა'

# 17) მომხმარებელს შემოატანინეთ რიცხვი, თუ ის მეტია 50-ზე დაბეჭდეთ ეს რიცხვი გამრავლებული 5-ზე, სხვა შემთხვევაში დაბეჭდეთ ეს რიცხვი კვადრატში.

# 18) მომხმარებელს შემოატანინეთ პაროლი თუ ის უდრის მაგალითად "goa123"-ს დაბეჭდეთ "Password is correct!", სხვა შემთხვევაში დაბეჭდეთ "Incorrect password!"

# 19) მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ 1-დან შემოტანილის ჩათვლით ყველა რიცხვის ჯამი.


num=25
if num > 10:
    print('more than 10')
elif num < 10:
    print('less than 10')


num1=int(input('შემოიყვანეთ რიცხვი: '))
if num1==15:
    print('equal to 15')
else:
    print('not equal to 15')    


index=input('შემოიყვანეთ თქვენი ჯგუფის სახელი: ')
if index=='group92':
    print('you are correct')
else:
    print('you are wrong')


for i in range(50, 100, 5):
    print(i)


name='davit mikava'
for i in name:
    print(i)


num2=20
while num2<50:
    print(num2)
    num2+=1


for i in range(100):
    print(i)

num3=0
while num3<100:
    print(num3)
    num3+=1


for i in range(101):
    print(i)

num4=0
while num4<101:
    print(num4)
    num4+=1


for i in range(10, 20):
    print(i)

num5=10
while num5<20:
    print(num5)
    num5+=1


for i in range(100, 200, 5):
    print(i)

num6=100
while num6<200:
    print(num6)
    num6+=5


for i in range(0, 10, -1):
    print(i)

num7=10
while num7>0:
    print(num7)
    num7-=1


index1=int(input('შემოიყვანეთ ნებისმიერი რიცხვი; '))
if index1==0:
    print('ეს რიცხვი ნულია')
elif index1<0:
    print('ეს რიცხვი უარყოფითი რიცხვია')
elif index1>0:
    print('ეს რიცხვი დადებითი რიცხვია')


age=int(input('შემოყვანეთ თქვენი ასაკი: '))
if age<12:
    print('ბავშვი ხარ')
elif age>13 and age<19:
    print('მოზარდი/თინეიჯერი ხარ')
elif age>20 and age<64:
    print('ზრდასრული ხართ')
elif age>65 and age<120:
    print('ხანში შესული ხართ')
elif age>120:
    print('გურუ ან ჯადოქარი')
elif age<0:
    print('არასწორი ინფო')


# 15) მომხმარებელს შემოატანიეთ სამი რიცხვი(მთელი/ათწილადი) და ამ სამი რიცხვთაგან დაბეჭდეთ უდიდესი
#  ვერ გავიგე!


num8=input('შემოიყვანეთ 1-დან 7-ის ჩათვლით ნებისმიერი ციფრი: ')
if num8==1:
    print('ორშაბათი')
elif num8==2:
    print('სამშაბათი')
elif num8==3:
    print('ოთხშაბათი')
elif num8==4:
    print('ხუთშაბათი')
elif num8==5:
    print('პარასკევი')
elif num8==6:
    print('შაბათი')
elif num8==7:
    print('კვირა')
else:
    print('არ ვიცი ეგ რა დღეა')


num9=int(input('შემოიყვანეთ რიცხვი: '))
if num9>50:
    print(num9*5)
else:
    print(num9*num9)


password=input('შემოიყვანეთ პაროლი: ')
if password=='goa123':
    print('password is correct')
else:
    print('icorrect pasword')


num10=int(input('შემოიყვანეთ ნებისმირი რიცხვი: '))
total=0
for i in range(1, num10+1):
    total+=i
print(total)


