
# 2) მომხმარებელს შემოაყვანინე სამი რიცხვი, ხოლო პროგრამამ დაბეჭდოს მათი საშუალო არითმეტიკული.

# 3) მომხმარებელს შემოატანინე ორი რიცხვი და დაბეჭდე მათი ჯამი.

# 4) input ფუნქციის საშუალებით შემოიყვანეთ თქვენი და თქვენი ოჯახის წევრების სახელები და დაპრინტეთ ერთი დიდი წინადადება კონკატენაციის სახით.

# 5) მომხმარებელს შემოატანინეთ მისი ქალაქის, უბნის, კორპუსის და სართულის შესახებ ინფორმაცია (რომლებიც უნდა შეინახოთ ცალ-ცალკე ცვლადებში). მაგ. city = "Tbilisi", District = "{თქვენი უბანი}" და ა.შ. საბოლოოდ print() ბრძანების საშუალებით ტერმინალში გამოიტანეთ მომხმარებლის სრული მისამართი.

# 6) მომხმარებელს შემოატანინეთ ასაკი და ამოყენებითმსგავსი ფორმატის წინადადება: 
# "You are ასაკი years old".

num1 = float(input("შემოიყვანე პირველი რიცხვი: "))
num2 = float(input("შემოიყვანე მეორე რიცხვი: "))
num3 = float(input("შემოიყვანე მესამე რიცხვი: "))
print((num1 + num2 + num3) // 3)


num1 = float(input("შემოიყვანე პირველი რიცხვი: "))
num2 = float(input("შემოიყვანე მეორე რიცხვი: "))
print(num1 + num2)


my_name = str(input("საკუთარი სახელი: "))
sister = str(input("დის სასხელი: "))
mom = str(input("დედის სახელი: "))
dad = str(input("მამის სახელი: "))
print("მე " + my_name + " და ჩემი და " + sister + " ვართ " + dad + "ის და " + mom + "ის შვილები")


city = str(input("თქვენი ქალაი: "))
district = str(input("თქვენი უბანი: "))
corps = str(input("თქვენი კორპუსი: "))
floor = str(input("თქვენი სართული: "))
print(city + "," + district + "," + corps + "," + floor)


age = str(input("თქვენი ასაკი: "))
print("You are" + age + "years old")
