# 2) კომენტარების სახით ჩამთვალეთ ყველა შედარებითი ოპერატორები და გააკეთეთ 5-5 ნაგალითი თითოეულზე.

# 3) კომენტარების სახით ახსენით რა არის logical operators, ჩამოწერეთ თითოეული და განმარტეთ რომელი რა დროს რა შედეგს გვიბრუნებს.

# 4) გააკეთეთ 3-3 მაგალითი logical operator-ებზე.

# 5) მომხმარებელს შემოატანინეთ რიცხვი, შეინახეთ იგი ცვლადში და შეადარეთ იგი მეტია თუ არა თქვენს მიერ წინასწარ გამზადებულ რიცხვზე.

# 6) მომხმარებელს შემოატანინეთ სახელი, შეინახეთ იგი ცვლადში და მკაცრად შეამოწმეთ უდრის თუ არა იგი თქვენს სახელს.

# 7) მომხმარებელს შემოატანინეთ თავისი ასაკი, შეინახეთ იგი ცვლადში და შეამოწმეთ მეტია თუ არა იგი 18.


#შედარებითი ოპერატორები: <, ,>, <=, >=, ==, !=

print(2<6)
print(5<8)
print(11<33)
print(64<279)
print(34<98)

print(23>15) 
print(47>2)
print(54>47)
print(89>80)
print(65>30)

print(3<=3)
print(54<=87)
print(32<=44)
print(36<=36)
print(99<=100)

print(87>=80)
print(50>=50)
print(21>=13)
print(90>=90)
print(31>=30)

print(10==10)
print(1.5==1.5)
print(0==0.0)
print(5==3)
print(10==10)

print(10!=5)
print(0!=1)
print(2.5!=2.6)
print(7!=5)
print(100!=99)

# logical operators არის ლოგიკური მოქმედებები რომელშიც შედის and და or კავშირები, მათი გამოენებით შეგვიძლია გავიგოთ მოცემული პირობა შესრულდა თუ არა. როცა and-ის გამოყენებისას ორივე დასაკავშირებელი კომპონენტი უნდა იყოს true იმისთვის რომ შედეგი true მივიღოთ. or-ს გამოყენებისას ერთერთი დასაკავშირებელი კომპონენტი მაიც უნდა იყოს true იმისთვის რომ შედეგი true მივიღოთ.

print(True and True)
print(True and False)
print(False and False)

print(True or True)
print(True or False)
print(False or False)

num1=int(input('შემოიყვანეთ ნებისმიერირიცხვი: '))
num2=20
print(num1<num2)

name1=input('შემოიყვანეთ თქვენი სახელი: ')
name2='დავითი'
print(name1==name2)

age1=input('შემოიყვანეთ თქვენი ასაკი: ')
age2=18
print(age1>age2)