# 1) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი. (any index)

# 2) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა. (დადებითი index-ებით)

# 3) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა. (აურყოფითი index-ებით)


index=[2, 8.6, 'daviti', 16, True]
print(index[4])

index1=['Ferrari', 'Aston Martin', 'Alfa Romeo', 'Lexus', 'Porsche']
print(index1[1], index1[3])

index2=[2, 4, 6, 8, 10]
print(index2[-2], index2[-4])

