# slicing (ჭრა) არის სიიდან, სტრიქონიდან ან ტუპლიდან გარკვეული ნაწილის (ქვესიმრავლის) ამოჭრა.


fruits = ["ვაშლი", "ბანანი", "ატამი", "მსხალი", "ალუბალი"]
print(fruits[2])


numbers = [10, 20, 30, 40, 50]
numbers[1] = 25
print(numbers)



colors1 = ["წითელი", "მწვანე", "ლურჯი", "ყვითელი", "იასამნისფერი"]
index = int(input("შემოყვანეთ ინდექსი (0-დან 4-მდე): "))
print(colors1[index])


animals = ["ძაღლი", "კატა", "სპილო", "ვეფხვი", "ლომი"]
animals[-1] = "გემი"
print(animals)


colors2 = ["თეთრი", "შავი", "ნარინჯისფერი", "ვარდისფერი"]
index1 = int(input("შემოიყვანეთ ინდექსი (0-დან 3-მდე): "))
new_color = input("შემოიყვანეთ ახალი ფერი: ")
colors2[index1] = new_color
print(colors2)

