# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"

# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ რიცხვის კვადრატული მნიშნელობა.

# 6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.

# 7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი, თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.


#Custom ფუნქციები არის დეველოპერის მიერ შექმნილი კოდის მრავალჯერადი ბლოკები, რომლებიც იღებენ პარამეტრებს  და არგუმენტების გადაცემისას ასრულებენ კონკრეტულ დავალებას


def index(a, b):
    print(a+b)

index(10, 2)



def index1(num1):
    if num1%2==0:
        print("რიცხვი ლუწია")
    else:
        print("რიცხვი კენტია")   
        
index1(3)



def index2(num2):
    print(num2*num2)
    
index2(5)



def index3(sentence):
    print(sentence.upper())
 
index3('my name is davti')



def index4(name, lastname):
    print(f'my name is {name} and my last name is {lastname}')


index4('davit', 'mikava')







