# 1) მომხმარებელს შემოატანინეთ input-ის მეშვეობით თავისი სახელი, შეინახეთ იგი ცვლადში და ბეჭდეთ მიღებული მნიშვნელობა.

# 2) მომხარებელს შემოატანინეთ 2 ცალი რიცხვი სხვადასხვა დამოუკიდებელი input-ის მეშვეობით, ამის შემდეგ კი უბრალოდ დაბეჭდეთ ამ შემოყვანილი რიცხვების ჯამი. (დაგჭირდებათ int() ფუნქცია)

# 3) მომხმარებელს შემოატანინეთ თავისი ასაკი, თქვენი დავალებაა შემოყვანილი მნიშვნელობა გადაიყვანოთ integer ტიპის მონმაცემად და საბოლოოდ დაბეჭდოთ მომხმარებლის მიერ შემოყვანილი მნიშვნელობის მონაცემთა ტიპი.

# 4) შექმენით 3 ცვლადი, თითოულ ცვლადში შეინახეთ 1 მონაცემთა ტიპის მნიშვნელობა, თქვენი დავალებაა კი საბოლოოდ დაბეჭდოთ ამ ცვლადების მონაცემტა ტიპები.

name = input('შემოიყვანეთ თქვენი სახელი: ')
print(name)

number1 = input('შემოიყვანეთ პირველი რიცხვი: ')
number2 = input('შემოიყვანეთ მეორე რიცხვი: ')
print(int(number1) + int(number2))

age = input('შემოიყვანეთ თქვენი ასაკი: ')=
print(type(int(age)))

string = 'building'
integer = 12
float = 75.2
print(type(string))
print(type(integer))
print(type(float))