# 1) მომხმარებელს შემოატანინეთ თავისი სახელი, შეამოწმეთ თუ ის უდრის "davit"-ს, მაშინ დაბეჭდეთ "გაუმარჯოს დავით". სხვა შემთხვევაში "შენ არ ხარ დავითი"

# 2) მომხმარებელს შემოატანინეთ ამინდი და თუ ის არის "მზიანი", დაბეჭდეთ "ვივარჯიშებ გარეთ", სხვა შემთხვევაში თუ "მოღრუბლულია"-ა მაშინ დაბეჭდეთ "ვივარჯიშებ გარეთ ოღონდ მოგვიანებით", ხოლო სხვა დანარჩენ შემთხვევაში დაბეჭდეთ "საერთოდარ ვივარჯიშებ დღეს"


name=input('შემოიყვანეთ თქვენი სახელი: ')

if name == 'davit':
    print('გაუმარჯოს დავით')
else:
    print('შენ არ ხარ დავითი')



weather=input('შემოიყვანეთ ამინდი: ')

if weather == "მზიანი":
    print('ვივარჯიშებ გარეთ')
elif weather == 'მოღრუბლულია':
  print('ვივარჯიშებ გარეთ ოღონდ მოგვიანებით')
else:
  print('საერთოდ არ ვივარჯიშებ დღეს')